package ua.kiparys.perfectkiparysikbot;


import java.util.ArrayList;
import java.util.List;

public class Joke {
    private List<String> jokes = new ArrayList<>(List.of(
            "Рецепт черепахового супу з курки: \n1. Візьміть череп і пах курки...",
            "Чудово виступила на олімпіаді наша збірна з водного поло. Звісно ж, програли, але й не втопився ніхто... ",
            "– Тату, я більше з тобою не піду кататись на санках.\n– Мовчи і вези.",
            "Прораб Васильчук ніяк не може добудувати свій дім, так як постійно сам в себе краде цеглу.",
            "Син привів майбутню дружину додому. Всі довго мовчали. Першою заговорила бабка: \"Це вам за те, що не молитеся.\"",
            "-Дружино, чому я завше останній дізнаюся про те, що відбувається в цьому домі?\n-Тихіше, дитину розбудиш.\n-Яку дитину?",
            "Коли бабуся каже: “Я тобі борщ налила, сметану сам покладеш”, це пастка. Там немає місця для сметани.",
            "Надійна ознака, що побачення не вдалося: дівчина поглядає на годинник, що намалювала на зап'ясті.",
            "Великий китайський філософ Лао-цзи, що прожив 73 роки, за все своє життя ні разу не сказав \"Дякую\". А все тому, що він так і не вивчив українську.",
            "Як приємно знайти в кишені пальта 100 доларів! І це я працюю в гардеробі тільки перший день.",
            "Інеса намагалась триматись невимушено, але про себе проклинала цей гороховий суп.",
            "В швейному ательє:\n– Привіт, я хочу пошити штани.\n– Доброго дня! Сідайте, шийте.",
            "Ходили до сімейного психолога. Все було добре, доки лікар не підняла руку, а мій мужик не шуганувся.",
            "Замовила чоловіку на Миколая спінінг, прийшло червоне плаття… В когось таке було?",
            "Я не знаю, з чим були пиріжки, але червона шапочка розмовляла з Вовком і вони непогано розуміло одне одного.",
            "На корпоративі метеорологів було від 5 до 16 гостей. Місцями до 17.",
            "Навіть якщо увесь світ буде проти тебе, я буду стояти поруч і шепотітиму: “А я казала! А я, блін, казала!",
            "Німий півень зранку вібрує.",
            "В житті кожного чоловіка рано чи пізно настає той страшний момент, коли треба зібрати волю в кулак і відправитися купувати нові штани.",
            "Готувати просто. Іде пар - готується, іде дим - готово.",
            "– Чуєш, давай познайомимося.\n– Ні.\n– А чого?\n– Ви в спортивних штанях.\n– Ну і шо, і тобі купимо.",
            "Під час бійки згадав, чому мене навчив батько. Але вміння коптити свиню ніяк мені не допомогло.",
            "Коли дружина запитує: \"Що хочеш на вечерю?\", я ніколи не вгадую.",
            "Хлопець, який сходив тільки на один урок карате, встиг лише вклонитись хуліганам.",
            "Щоб довести дівчині, що в тебе серйозні наміри, одразу після першого побачення познайом її з батьками, дружиною, дітьми.   ",
            "Патрульний Сидорчук зробив два попереджувальних у повітря і лише потім дістав пістолет.",
            "Фільм був таким нецікавим, що в залі цілувалися навіть незнайомі люди.",
            "От в Радянському Союзі не було ніяких коронавірусів, люди жили років по сто поки не розстріляють.",
            "Салат \"В пошуках Немо\". Рецепт: як оселедець під шубою, але без оселедця.",
            "Микола дуже образився, коли Наталка підписала диск з їх весільним відео: \"Моє перше весілля\".",
            "Циганський шахіст вважає, що партія програна, якщо він втратив обох коней."));


    public String getJoke(){
        return jokes.get((int) (Math.random() * jokes.size()));
    }

    public void addJoke(String joke){
        jokes.add(joke);
    }
}
